package tasks_todo;

/*
Создать программу выводящую заданное количество чисел Фибоначчи:
Программа выводит сообщение "Введите количество чисел Фибоначчи: " и ожидает ввода числа на той же строке, что и
сообщение. Число должно быть больше 20:
- при вводе 20 или цифры меньше 20, программа выводит сообщение "!!Количество чисел Фибоначчи должно быть больше 20!!"
    и с новой строки программа выводит предыдущее сообщение "Введите количество чисел Фибоначчи: " и ожидает ввода
    числа на той же строке.
- при вводе любых других символов или строк, появляется сообщение с ранее введенным значением
    "!!'<введенное значение>' не является числом!!". Т.е. если введено было Hello, то сообщение будет следующим
    "!!'Hello' не является числом!!". Далее с новой строки программа выводит предыдущее сообщение
    "Введите количество чисел Фибоначчи: " и ожидает ввода числа на той же строке.

Если число успешно введено, программа выводит заданное количество чисел Фибоначчи в формате:
    1 число Фибоначчи: 0
    2 число Фибоначчи: 1
    3 число Фибоначчи: 1
    4 число Фибоначчи: 2
    5 число Фибоначчи: 3
    6 число Фибоначчи: 5
    7 число Фибоначчи: 8
    ...
И т.д.
 */

public class Task5 {
    public static void main(String[] args) {

    }
}
